//################################################################
//
// ノーツが触れたときの振る舞いを記述
//
//================================================================


using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class NotesDestroy : MonoBehaviour
{
    //###### 他スクリプトの使用と準備 ##############################

    NotesScore cs_noteScore;

    //==============================================================


    public void Update()
    {
        //##### 得点加算　 #########################################

        

        //==========================================================

    }



    //##### 触れたときの値を受けてふるまう #########################
    public void Destroy_This(bool on)
    {

         Debug.Log("壊した");
         Debug.Log(on);
          
         Destroy(this.gameObject);
         
    }

    //==============================================================
}
