//################################################################
//
//　スコア表示
//
//================================================================
using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI; //テキストクラスを使用するため



public class NotesScore : MonoBehaviour
{

    //##### 必要変数を使用 #######################################

    //現在スコア
    public Text scoreText;
    public int score;

    //ハイスコア
    public Text highScoreText;
    private int highScore;

    // PlayerPrefsで保存するためのキー
    private string highScoreKey = "highScore";

    //============================================================



    //##### 初期化処理 ###########################################
    void Start()
    {
        Initialize();
    }
    //============================================================



    //##### 更新処理 #############################################
    void Update()
    {

        //***** ハイスコア更新処理 *******************************
        if (highScore < score)
        {
            highScore = score;
        }

        // スコア・ハイスコアを表示する
        scoreText.text = score.ToString();
        highScoreText.text = highScore.ToString();
        //++++++++++++++++++++++++++++++++++++++++++++++++++++++++



    }
    //============================================================



    //##### 初期化用関数 #########################################
    private void Initialize()
    {

        //***** スコア処理 **************************************
        // スコアを0に戻す
        score = 0;

        // ハイスコアを取得する。保存されてなければ0を取得する。
        highScore = PlayerPrefs.GetInt(highScoreKey, 0);

        //+++++++++++++++++++++++++++++++++++++++++++++++++++++++

    }
    //============================================================



    //##### ポイントの追加 #######################################
    public void AddPoint(int point)
    {
        score = score + point;
    }
    //============================================================



    //##### ハイスコアの保存 #####################################
    public void Save()
    {
        // ハイスコアを保存する
        PlayerPrefs.SetInt(highScoreKey, highScore);
        PlayerPrefs.Save();

        // ゲーム開始前の状態に戻す
        Initialize();
    }
    //============================================================
}
